app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (title LIKE '%testdate%') ORDER BY created_at DESC
SELECT COUNT(*) FROM "articles" WHERE (published_date - created_at'2017-04-24 11:51:57.192330')
---
  def index
   articles = [];
   due = 0;
   overdue = 0;
   Article.all.order("created_at ASC").each do |article|
     if (Time.now).to_date > article.published_date.to_date
        due = ((Time.now).to_date - article.published_date.to_date).to_i
        # puts "due ==#{due}==="
        article_json = article.to_json
        articles << JSON.parse(article_json).merge!(:due => due)
     else (Time.now).to_date < article.published_date.to_date
          overdue = (article.published_date.to_date - (Time.now).to_date).to_i
          # puts "overdue ==#{overdue}==="
          article_json = article.to_json
          articles << JSON.parse(article_json).merge!(:overdue => overdue)
     end
    end
      render :json => {articles: articles, count: Article.all.count, overdue: Article.where('published_date > ?', Time.now).count}

SELECT "articles".* FROM "articles" WHERE ( (UPPER(articles.title) like '%s%') ORDER BY created_at ASC
SELECT COUNT(*) FROM "articles" WHERE (published_date > '2017-04-28 05:40:53.167008')
---
   def search
    if params[:search]
      articles = [];
      due = 0;
      overdue = 0;
      Article.search(params[:search]).order("created_at ASC").each do |article|
        if (Time.now).to_date > article.published_date.to_date
            due = ((Time.now).to_date - article.published_date.to_date).to_i
            # puts "due ==#{due}==="
            article_json = article.to_json
            articles << JSON.parse(article_json).merge!(:due => due)
        else (Time.now).to_date < article.published_date.to_date
              overdue = (article.published_date.to_date - (Time.now).to_date).to_i
              # puts "overdue ==#{overdue}==="
              article_json = article.to_json
              articles << JSON.parse(article_json).merge!(:overdue => overdue)
        end
        end
          render :json => {articles: articles, count: Article.all.count, overdue: Article.where('published_date > ?', Time.now).count}

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "published_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testdate"], ["body", "testdate1"], ["created_at", 2017-04-26 14:01:40 UTC], ["updated_at", 2017-04-26 14:01:40 UTC], ["published_date", Wed, 19 Apr 2017]]
---
  def create
    puts "#{params.inspect}"
    Article.create(title: params[:title], body: params[:body], published_date: params[:published_date])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "Each Daily News Article contains comprehension and critical thinking questions, found below the article"], ["updated_at", 2017-04-21 12:21:28 UTC], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)